In [1]:
import pymysql
import pandas as pd

import warnings

In [2]:
warnings.filterwarnings('ignore')

In [76]:
try:
    connection = pymysql.connect(user='admin',
                                host='database-1.cjocas8y2rhl.us-east-1.rds.amazonaws.com',
                                port=3306,
                                password='Uukkmskp1!#',
                                database='grupo_05'
                                )
    print('Conexão feita com sucesso!')
except Exception as erro:
    print(f'Erro: {erro} - Falha na conexão')
    
cursor = connection.cursor()

Conexão feita com sucesso!

In [39]:
df = pd.read_csv('../data/clientes_genericos.csv')  
df = df[['Nome', 'Numero', 'Endereco']]

df

,Nome,Numero,Endereco
0,Marina Ribeiro,0900 145 8316,"Estrada de Albuquerque, 3, Vila Nova Gameleira..."
1,Maria Julia Caldeira,+55 81 0704-5986,"Quadra Vieira, 53, Teixeira Dias, 38987482 Rez..."
2,Maria Clara Campos,51 0650 6372,"Esplanada Silveira, 74, Ouro Minas, 70469141 G..."
3,Stephany Lopes,41 8023-9362,"Via de Oliveira, 1, Aguas Claras, 53142-358 da..."
4,Ana Lívia Souza,(051) 0318 9411,"Vereda de Gomes, Ermelinda, 06286583 Alves / DF"
...,...,...,...
145,Luiz Felipe Novais,+55 (071) 1955-2433,"Aeroporto Pires, 61, Nossa Senhora Da Conceiçã..."
146,Nicole Pires,(021) 8618 7061,"Residencial Albuquerque, Vila Pinho, 24945841 ..."
147,Maria Alice Garcia,41 7787-1865,"Viaduto da Mota, 67, Anchieta, 38310-017 Fogaç..."
148,Theodoro Barbosa,+55 (081) 7012-9506,"Pátio João Vitor da Rosa, 48, Vila Minaslandia..."
149,Cauê Carvalho,84 9382-9579,"Passarela de Pereira, 82, Leonina, 38462287 Vi..."

In [5]:
for index, row in df.iterrows():
    query_insert = """
        INSERT INTO clientes (nome_cliente, telefone_cliente, endereco_cliente) 
        VALUES (%s, %s, %s)
    """
    values = (row['Nome'], row['Numero'], row['Endereco'])

    cursor.execute(query_insert, values)

connection.commit()

In [6]:
query = '''
    INSERT INTO produtos (nome_produto, descricao_produto) 
    VALUES
    ("Credito", "Ferramenta que permite que indivíduos e empresas obtenham dinheiro emprestado para atender a necessidades financeiras imediatas"),
    ("Investimento", "Qualquer valor capaz de gerar um lucro, seja em um período de curto, médio ou longo prazo"),
    ("Seguros", "Sao aqueles bens, especificados na apolice, para os quais a seguradora não indenizara os prejuízos, ainda que oriundos de riscos cobertos")
'''

cursor.execute(query)
connection.commit()

In [7]:
query = '''
    INSERT INTO diretoria (nome_diretor, email_diretor) 
    VALUES 
    ("João da Silva", "joao@dasilva.com.br"),
    ("Maria da Silva", "maria@dasilva.com.br"),
    ("Julio da Silva", "julio@dasilva.com.br")
'''

cursor.execute(query)
connection.commit()

In [ ]:
query = '''
    INSERT INTO tipo_cliente (tipo_cliente) 
    VALUES 
    ("Digital"),
    ("Alta Renda"),
    ("Private")
'''

cursor.execute(query)
connection.commit()

In [9]:
query = '''
    INSERT INTO tipo_produto (tipo_produto)
    VALUES
    ("Com lastro financeiro"),
    ("Sem lastro financeiro")
'''

cursor.execute(query)
connection.commit()

In [10]:
query = ''' 
    SELECT * FROM produtos
'''

pd.read_sql(query, connection)

,cod_produto,nome_produto,descricao_produto,cod_tipo_produto
0,1,Credito,Ferramenta que permite que indivíduos e empres...,None
1,2,Investimento,"Qualquer valor capaz de gerar um lucro, seja e...",None
2,3,Seguros,"Sao aqueles bens, especificados na apolice, pa...",None
3,7,Credito,Ferramenta que permite que indivíduos e empres...,None
4,8,Investimento,"Qualquer valor capaz de gerar um lucro, seja e...",None
5,9,Seguros,"Sao aqueles bens, especificados na apolice, pa...",None
6,10,Credito,Ferramenta que permite que indivíduos e empres...,None
7,11,Investimento,"Qualquer valor capaz de gerar um lucro, seja e...",None
8,12,Seguros,"Sao aqueles bens, especificados na apolice, pa...",None

In [11]:
query = ''' 
    DELETE FROM produtos
    WHERE cod_produto = 7 OR cod_produto = 8 OR cod_produto = 9
'''

cursor.execute(query)
connection.commit()

In [13]:
query = ''' 
    SELECT * FROM logs
'''

pd.read_sql(query, connection)

,log_id,tabela_afetada,acao,usuario,descricao,data_acao
0,41,clientes,INSERT,admin@45.227.55.143,Novo cliente inserido,2024-09-30 21:28:09
1,42,clientes,INSERT,admin@45.227.55.143,Novo cliente inserido,2024-09-30 21:28:09
2,43,clientes,INSERT,admin@45.227.55.143,Novo cliente inserido,2024-09-30 21:28:09
3,44,clientes,INSERT,admin@45.227.55.143,Novo cliente inserido,2024-09-30 21:28:09
4,45,clientes,INSERT,admin@45.227.55.143,Novo cliente inserido,2024-09-30 21:28:09
...,...,...,...,...,...,...
156,197,tipo_produto,INSERT,admin@45.227.55.143,Novo tipo de produto inserido,2024-09-30 21:29:46
157,198,tipo_produto,INSERT,admin@45.227.55.143,Novo tipo de produto inserido,2024-09-30 21:29:46
158,199,produtos,DELETE,admin@45.227.55.143,Produto excluído,2024-09-30 21:29:50
159,200,produtos,DELETE,admin@45.227.55.143,Produto excluído,2024-09-30 21:29:50
160,201,produtos,DELETE,admin@45.227.55.143,Produto excluído,2024-09-30 21:29:50

In [40]:
query = ''' 
    SHOW TABLES

'''

pd.read_sql(query, connection)

    Tables_in_grupo_05
0           categorias
1      cliente_produto
2             clientes
3            diretoria
4                 logs
5            produto_2
6             produtos
7  produtos_categorias
8         tipo_cliente
9         tipo_produto

In [64]:
query = ''' 
    INSERT INTO produto_2 (id, nome, preco) VALUES
    (1, 'Smartphone', 1500.00),
    (2, 'Laptop', 3500.00),
    (3, 'Televisão', 2000.00),
    (4, 'Fone de Ouvido Bluetooth', 75.00),
    (5, 'Smartwatch', 70.00),
    (6, 'Monitor 24"', 900.00),
    (7, 'Teclado Mecânico', 300.00),
    (8, 'Mouse Gamer', 200.00),
    (9, 'Caixa de Som Bluetooth', 450.00),
    (10, 'Microfone Condensador', 600.00),
    (11, 'Câmera DSLR', 3500.00),
    (12, 'Impressora', 800.00),
    (13, 'Headset Gamer', 99.00),
    (14, 'Tablet', 1800.00),
    (15, 'Carregador Rápido', 50.00),
    (16, 'Pendrive 64GB', 80.00),
    (17, 'Placa de Vídeo', 4200.00),
    (18, 'Gabinete Gamer', 550.00),
    (19, 'Fonte 600W', 40.00),
    (20, 'SSD 1TB', 850.00);

'''

cursor.execute(query) 
connection.commit()

In [65]:
query = ''' 
    INSERT INTO categorias (id, nome) VALUES
    (1, 'Eletrônicos'),
    (2, 'Periféricos'),
    (3, 'Áudio'),
    (4, 'Computadores e Acessórios');

'''

cursor.execute(query) 
connection.commit()

In [66]:
query = ''' 
    INSERT INTO categorias (id, nome) VALUES
    (5, 'Cama e banho');

'''

cursor.execute(query) 
connection.commit()

In [67]:
query = ''' 
    INSERT INTO produtos_categorias (produto_id, categoria_id) VALUES
    (1, 1),
    (2, 4),
    (3, 1),
    (4, 3),
    (5, 1),
    (6, 4),
    (7, 2),
    (8, 2),
    (9, 3),
    (10, 3),
    (11, 1),
    (12, 4),
    (13, 2),
    (14, 1),
    (15, 4),
    (16, 4),
    (17, 4),
    (18, 4),
    (19, 4),
    (20, 4);
'''

cursor.execute(query) 
connection.commit()

In [68]:
# 3

query = ''' 
SELECT
    nome AS Produto,
    preco AS Valor
FROM
    produto_2
WHERE
    preco > 100
ORDER BY
    preco DESC,
    nome ASC;
'''

pd.read_sql(query, connection)

                   Produto   Valor
0           Placa de Vídeo  4200.0
1              Câmera DSLR  3500.0
2                   Laptop  3500.0
3                Televisão  2000.0
4                   Tablet  1800.0
5               Smartphone  1500.0
6              Monitor 24"   900.0
7                  SSD 1TB   850.0
8               Impressora   800.0
9    Microfone Condensador   600.0
10          Gabinete Gamer   550.0
11  Caixa de Som Bluetooth   450.0
12        Teclado Mecânico   300.0
13             Mouse Gamer   200.0

In [69]:
# 4
query = ''' 
SELECT
    id,
    preco
FROM
    produto_2
WHERE
    preco > (SELECT AVG(preco) FROM produto_2);
'''

pd.read_sql(query, connection)

   id   preco
0   1  1500.0
1   2  3500.0
2   3  2000.0
3  11  3500.0
4  14  1800.0
5  17  4200.0

In [72]:
# 5
query = '''SELECT 
    c.nome as Categoria,
    AVG(p.preco) as Preco_Medio 
FROM
    produto_2 p
    JOIN produtos_categorias pc
        ON p.id = pc.produto_id
    JOIN categorias c
        ON c.id = pc.categoria_id
GROUP BY c.nome
ORDER BY c.nome DESC;

'''
pd.read_sql(query, connection)

                   Categoria  Preco_Medio
0                Periféricos   199.666667
1                Eletrônicos  1774.000000
2  Computadores e Acessórios  1218.888889
3                      Áudio   375.000000

In [ ]:
# 6
query = '''
CREATE TABLE turma (
    id_turma INT PRIMARY KEY AUTO_INCREMENT,
    codigo_turma VARCHAR(50),
    nome_turma VARCHAR(100)
);

CREATE TABLE aluno (
    id_aluno INT PRIMARY KEY AUTO_INCREMENT,
    nome_aluno VARCHAR(100),
    aluno_alocado BOOLEAN,
    id_turma INT,
    FOREIGN KEY (id_turma) REFERENCES turma(id_turma)
);
'''
cursor.execute(query) 
connection.commit()

In [ ]:
# 7 A
query = ''' 
INSERT INTO turma (codigo_turma, nome_turma)
VALUES ('TURMA1', 'Turma de Python'),
       ('TURMA2', 'Turma de SQL')
       
'''
cursor.execute(query) 
connection.commit()

In [ ]:
# 7 B
query = '''
INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma)
VALUES ('Luiz Gomes, NULL, 1),
       ('Amanda Kim', NULL, 2);
'''
cursor.execute(query) 
connection.commit()

In [ ]:
# 7 C
query = '''
NSERT INTO aluno (nome_aluno, aluno_alocado, id_turma)
VALUES ('Luiz Silva, NULL, NULL),
       ('Ana Costelo', NULL, NULL);
'''

cursor.execute(query)
connection.commit()

In [ ]:
# 7 D
query ='''
UPDATE aluno
SET aluno_alocado = TRUE
WHERE id_turma IS NOT NULL;

UPDATE aluno
SET aluno_alocado = FALSE
WHERE id_turma IS NULL;
'''

cursor.execute(query)
connection.commit()

In [62]:
connection.close()